<?php


namespace App\Services;


class Form
{
    /*
     * Форма создания/редактирования – попытаться создать средствами php, который бы генерировал html.
        a. Условно класс Form, от которого можно унаследоваться и переопределить метод build,
           в котором пишется описание формы, ее столбцы в них параметры типо класс, аттрибуты, значение и тд.
        b. Метод render, который по уже имеющимся полям build, рисует html форму на экран.
        c. Постараться не забыть о том, чтобы на форму можно было навешивать какой то js код.(не обязательно, но круто)
     *  */
    public function build()
    {

    }

    public function render()
    {

    }
}
